Repository: zenofewords/thebrushstash
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hr

source: Required
hr: Obavezno

source: An account with this e-mail address already exits.
hr: Korisnički račun s ovom e-mail adresom već postoji

source: The two password fields didn't match.
hr: Lozinke se ne podudaraju

source: Password
hr: Lozinka

source: Password confirmation
hr: Potvrdite lozinku

source: Repeat password
hr: Ponovite lozinku

source: Enter the same password as above, for verification.
hr: Ponovite istu lozinku za potvrdu

source: Note (optional)
hr: Napomena (neobavezno)

source: Select country
hr: Odaberite državu

source: First name
hr: Ime

source: Last name
hr: Prezime

source: Address
hr: Adresa

source: City
hr: Grad

source: Postcode/ZIP
hr: Poštanski broj

source: State/County (optional)
hr: Kat

source: E-mail address
hr: E-mail adresa

source: Phone number
hr: Telefon

source: Company name
hr: Ime tvrtke

source: Company address
hr: Adresa tvrtke

source: Company UIN
hr: OIB tvrtke

source: Create an account
hr: Kreirajte korisnički račun

source: Join to get the latest news from TBS
hr: Saznajte najnovije TBS vijesti

source: I need an R1 receipt
hr: Želim R1 račun

source: I have read and agree to the <a href="/general-terms-and-conditions/" target="_blank" rel="noopener noreferrer">terms and conditions</a>
hr: Pročitao sam i pristajem na <a href="/general-terms-and-conditions/" target="_blank" rel="noopener noreferrer">uvjete korištenja</a>

source: You must agree to the terms and conditions to continue.
hr: Potrebno je pristati na uvjete korištenja prije nastavka kupnje.

source: Checkout
hr: Blagajna

source: Previous step
hr: Prethodni korak

source: Add to bag
hr: Dodaj u košaricu

source: 1. Billing & shipping address
hr: 1. Adresa za dostavu i naplatu

source: If you already have an account you should <a href="%(login_url)s?next=%(checkout_url)s">log in</a>. Your address information will be automatically populated.
hr: Ukoliko već imate korisnički račun, <a href="%(login_url)s?next=%(checkout_url)s">logirajte se</a> kako bi se vaši podaci za dostavu automatski popunili

source: Please make sure the information listed below is correct.
hr: Molimo provjerite točnost unešenih podataka.

source: This field is required.
hr: Ovo polje je obavezno.

source: Type in a valid e-mail address.
hr: Upišite ispravnu e-mail adresu.

source: Contact number is required for receiving sms info from our courier about the exact date and approximate time frame of delivery.
hr: Kontakt broj služi kako biste mogli primiti sms obavijest od GLS-a o točnom danu i okvirnom terminu isporuke, a sve narudžbe koje uključuju plaćanje pouzećem, prethodno ćemo potvrditi telefonski.

source: Your personal data will be used to process your order, support your experience throughout this website, and for other purposes described in our <a href="%(terms_url)s" target="_blank" rel="noopener noreferrer">privacy policy</a>.
hr: Vaši osobni podaci koristit će se isključivo u svrhu procesuiranja narudžbi, poboljšanja korisničkog iskustva na ovim stranicama te ostale svrhe opisane u našim <a href="%(terms_url)s" target="_blank" rel="noopener noreferrer">Općim uvjetima i politici privatnosti</a>.

source: Continue to payment
hr: Nastavite na plaćanje

source: 3. Shipping address
hr: 3. Odaberite adresu dostave

source: Same as billing address
hr: Isto kao i adresa naplate

source: Use a different address
hr: Koristite drugu adresu za dostavu

source: Place order
hr: Potvrdite narudžbu

source: 2. Payment
hr: 2. Plaćanje

source: Select your payment method and place your order.
hr: Odaberite način plaćanja i potvrdite narudžbu.

source: Cash on delivery
hr: Plaćanje pouzećem

source: Note: requires an additional fee for the GLS service
hr: Napomena: GLS naplaćuje dodatnu naknadu za ovu uslugu

source: For security reasons, every cash on delivery order must be verified by phone.
hr: Iz sigurnosnih razloga, sve narudžbe koje uključuju plaćanje pouzećem, prije slanja potvrdit ćemo telefonski.

source: Use a credit card
hr: Kartična plaćanja

source: Note: all payments are processed in Croatian Kuna (HRK). Prices in other currencies are shown for information purposes only and are calculated by the Croatian National Bank (HNB) average daily exchange rate.
hr: Napomena: sva plaćanja se izvršavaju u hrvatskim kunama. Cijene izražene u stranim valutama su samo informativnog karaktera i prikazane su prema dnevnom srednjem tečaju Hrvatske Narodne Banke.

source: Coming soon
hr: Dolazi uskoro

source: New
hr: Novo

source: *Prices include VAT. <a class="link" href="%(pandd_url)s"> Shipping costs apply </a>
hr: *U cijene je uključen PDV. <a class="link" href="%(pandd_url)s"> Opcije dostave </a>

source: About
hr: Detalji o kistu

source: Reviews
hr: Recenzije

source: Rating is required.
hr: Potrebno je dati ocjenu.

source: Submit review
hr: Ostavite recenziju

source: More from our shop
hr: Više iz naše ponude

source: Purchase Cancelled
hr: Narudžba otkazana

source: You have cancelled your order
hr: Vaša narudžba je otkazana

source: You can always continue from where you left off if you change your mind.
hr: U slučaju da se predomislite, uvijek možete nastaviti gdje ste stali.

source: Your order has been confirmed!
hr: Vaša narudžba je potvrđena!

source: You're receiving this e-mail because you created an account at The Brush Stash Webshop.
hr: Uspješno ste kreirali korisnički račun na The Brush Stash Webshop.

source: You can activate your account at the following page:
hr: Svoj korisnički račun možete aktivirati ovdje:

source: Your username, in case you've forgotten:
hr: Vaše korisničko ime, u slučaju da ste ga zaboravili:

source: Thank you for using The Brush Stash!
hr: Hvala Vam što koristite The Brush Stash!

source: Dear customer, you have subscribed to The Brush Stash Webshop newsletter! We will contact you only in cases of new products arriving or discounts and special offers.
hr: Dragi naši, upravo ste se pretplatili na The Brush Stash Webshop newsletter! Budući da nam je svima dosta pretjerane količine mailova, javljat ćemo vam se samo u slučaju dolaska novih proizvoda ili kako bismo vas obavijestiti o eventualnim posebnim ponudama.

source: Thank you for your order and for choosing The Brush Stash! Your parcel will be packaged and shipped to your address as soon as possible.
hr: Hvala Vam na kupnji i povjerenju koje ste nam ukazali odabirom The Brush Stash kistova! Paketić ćemo pripremiti i poslati na Vašu adresu u najkraćem mogućem roku.

source: Your order number is:
hr: Broj Vaše narudžbe je:

source: BILLING TO:
hr: ADRESA ZA NAPLATU:

source: SHIPPING TO:
hr: ADRESA DOSTAVE:

source: ITEMS ORDERED
hr: NARUČENI PROIZVODI:

source: PRODUCT
hr: PROIZVOD

source: PRICE
hr: CIJENA

source: QTY
hr: KOL

source: TOTAL
hr: UKUPNO

source: PAYMENT:
hr: NAPLATA:

source: Subtotal:
hr: Cijena:

source: VAT included:
hr: Uključen PDV:

source: Shipping:
hr: Dostava:

source: GLS (cash on delivery):
hr: GLS (plaćanje pouzećem):

source: Grand total:
hr: Ukupna cijena:

source: Grand total (HRK):
hr: Ukupna cijena (HRK):

source: Thank you for using The Brush Stash products!
hr: Hvala Vam što koristite The Brush Stash proizvode!

source: Purchase complete
hr: Vaša narudžba je izvršena!

source: Thank you for your purchase!
hr: Zahvaljujemo Vam na kupnji!

source: Your order was successfully processed and will be shipped soon. Check your e-mail for details.
hr: Vaša narudžba je uspješno izvršena i uskoro će biti poslana. Provjerite e-mail za detalje!

source: The provided e-mail address is already registered at The Brush Stash Webshop.
hr: Odabrana e-mail adresa je već registrirana na The Brush Stash Webshop.

source: If you forgot your password
hr: Ako ste zaboravili lozinku

source: click this link
hr: kliknite ovdje

source: Check your e-mail to complete the registration
hr: Provjerite svoj e-mail kako biste potvrdili registraciju

source: To finish your registration you need to visit the activation link which was sent to your e-mail address.
hr: Kako biste završili registraciju, kliknite na aktivacijski link koji smo poslali na Vašu e-mail adresu.

source: The provided e-mail address is already subscribed to our newsletter.
hr: Odabrana e-mail adresa je već pretplaćena na naš newsletter.

source: You've been subscribed to our newsletter!
hr: Uspješno ste se pretplatili na naš newsletter!

source: Review Your Bag
hr: Pregled košarice

source: Product &amp; price
hr: Proizvod i cijena

source: Quantity
hr: Količina

source: Subtotal
hr: Cijena

source: Order summary
hr: Pregled narudžbe

source: Total:
hr: Cijena proizvoda:

source: VAT (included in price):
hr: PDV (uključen u cijenu):

source: Check out
hr: Plaćanje

source: Continue shopping
hr: Nastavak kupnje

source: You've registered an account with The Brush Stash!
hr: Registrirali ste se na The Brush Stash!

source: Success
hr: Uspjeh!

source: Your account has been successfully activated, but you still need a password. Pick a strong one!
hr: Vaš korisnički račun je kreiran, ali još uvijek trebate lozinku. Odaberite složeniju i sigurniju lozinku!

source: Submit
hr: Potvrdi unos

source: Great failure
hr: Veliki neuspjeh

source: Your activation token is not valid.
hr: Vaš aktivacijski token nije ispravan.

source: Verification e-mail Sent
hr: E-mail za verifikaciju poslan

source: You already have an account and are currently logged in. Why don't you check out some <a href="%(shop_url)s#products-anchor">brushes</a>?
hr: Već ste ulogirani u svoj postojeći korisnički račun. Bacite pogled na naše <a href="%(shop_url)s">kistove</a>?

source: We've sent you a verification e-mail. Check your inbox and click on the link to complete the registration.
hr: Na Vašu e-mail adresu stiže poruka za verifikaciju! Provjerite inbox i kliknite na link kako biste dovršili registraciju.

source: Register
hr: Registriraj se

source: Provide us with an e-mail address so we can send you an activation link for your account.
hr: Unesite e-mail adresu kako bismo Vam poslali link za aktivaciju korisničkog računa.

source: Send me my activation link
hr: Pošaljite mi aktivacijski link

source: Your subscription token is not valid.
hr: Vaš aktivacijski token nije ispravan.

source: Activate your newsletter subscription here:
hr: Pretplatu na newsletter možete aktivirati ovdje:

source: Thank you, best regards,<br>your The Brush Stash team
hr: Hvala vam, srdačan pozdrav,<br>vaš The Brush Stash team

source: Unsubscribed
hr: Odjava

source: You've been unsubscribed from our newsletter.
hr: Uspješno ste se odjavili s The Brush Stash Webshop obavijesti.

source: Your token is not valid.
hr: Vaš token nije ispravan.

source: Login
hr: Ulogirajte se

source: You are already logged in
hr: Već ste ulogirani

source: You can <a href="%(shop_url)s#products-anchor">find our brushes here</a>.
hr: Naše <a href="%(shop_url)s">kistove možete pronaći ovdje</a>.

source: Unless you'd like to <a href="%(logut_url)s">logout</a> instead.
hr: Osim ako biste se radije <a href="%(logut_url)s">izlogirali</a>.

source: Don't have an account? <a href="%(register_url)s" class="register">Register here</a>
hr: Nemate korisnički račun? <a href="%(register_url)s" class="register">Registrirajte se ovdje</a>

source: Forgot your password?
hr: Zaboravili ste lozinku?

source: Password Reset
hr: Resetirajte lozinku

source: Your password has been reset.
hr: Vaša lozinka je promijenjena.

source: Log in
hr: Ulogirajte se

source: Set new password
hr: Postavite novu lozinku

source: Please enter your new password twice so we can verify you typed it in correctly.
hr: Molimo, unesite Vašu novu lozinku dvaput kako bismo provjerili da ste je unijeli ispravno.

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
hr: Link za promjenu lozinke je nevažeći. Moguće da je već iskorišten. Molimo zatražite novu promjenu lozinke.

source: Password Reset e-mail Sent
hr: E-mail poruka za promjenu lozinke poslana

source: We've emailed you instructions for resetting your password.
hr: Poslali smo Vam upute za promjenu lozinke.

source: If you don't find the reset e-mail, please make sure you've entered the correct information and check your spam folder.
hr: Ako ne možete pronaći e-mail poruku s uputama za promjenu lozinke, provjerite da li ste unijeli ispravne podatke te provjerite spam folder.

source: You're receiving this e-mail because you requested a password reset for your user account at %(site_name)s.
hr: Dobili ste ovu poruku jer ste zatražili promjenu lozinke za Vaš korisnički račun na %(site_name)s.

source: You can choose a new password at the following page:
hr: Možete odabrati novu lozinku na:

source: Reset Password
hr: Promijenite lozinku

source: You are currently logged in.
hr: Trenutačno ste ulogirani.

source: Type in the e-mail which you used to register and we'll send you a password reset link.
hr: Unesite e-mail adresu s kojom ste se registrirali i poslat ćemo Vam link za izmjenu lozinke.

source: About / The Story
hr: O nama / O kistovima

source: The Brush Stash Webshop | Luxury makeup brushes handmade in Japan
hr: The Brush Stash Webshop | Luksuzni hrvatski kistovi za šminkanje ručno proizvedeni u Japanu

source: the brush stash brushes, the brush stash buy, japanese brushes, kumano brushes, handmade makeup brushes, luxury makeup, makeup brushes, kumano fude, high end brushes, luxury cosmetics
hr: the brush stash kistovi, the brush stash kupi, japanski kistovi, kumano kistovi, ručno rađeni kistovi, luksuzni kistovi, kistovi za šminkanje, kumano fude, kistovi visoke kvalitete, luksuzna kozmetika

source: The Brush Stash brush collection
hr: The Brush Stash kolekcija kistova

source: Brush Care
hr: Održavanje kistova

source: Contact
hr: Kontakt

source: FAQ
hr: Česta pitanja

source: FREQUENTLY ASKED QUESTIONS
hr: ČESTO POSTAVLJANA PITANJA

source: General Terms and Conditions
hr: Opći uvjeti i odredbe

source: In your bag
hr: U košarici

source: Quantity:
hr: Količina:

source: Buy some brushes
hr: Vaša košarica je prazna

source: Review bag
hr: Pregled košarice

source: Payment and Delivery
hr: Plaćanje i dostava

source: Returns and Complaints
hr: Povrati i reklamacije

source: The Brush Stash uses cookies to ensure a better user experience and the functionality of the site. By continuing to browse you agree to the use of cookies. <a class="link-in-text" href="%(terms_url)s">Learn more here</a>.
hr: The Brush Stash koristi kolačiće u svrhu boljeg korisničkog iskustva i poboljšane funkcionalnosti stranice. Daljnjim pregledom stranice pristajete na uporabu kolačića. <a class="link-in-text" href="%(terms_url)s">Više saznajte ovdje</a>.

source: Follow us on
hr: Pratite nas na

source: The Brush Stash. All rights reserved.
hr: The Brush Stash. Sva prava pridržana.

source: Login/Register
hr: Login/Registracija

source: Bag
hr: Košarica

source: Join our newsletter...
hr: Saznajte najnovije The Brush Stash vijesti...

source: Learn about new products and special offers!
hr: Budite u toku s novim proizvodima i posebnim ponudama!

source: Enter your e-mail
hr: Unesite Vašu e-mail adresu

source: Join
hr: Pošalji

source: Region:
hr: Regija:

source: Already subscribed.
hr: Već ste prijavljeni na newsletter.

source: Subscribed, thanks!
hr: Prijavljeni ste, hvala!

source: Check your e-mail for confirmation!
hr: Provjerite svoj e-mail kako biste potvrdili pretplatu na newsletter!

source: Activate your account
hr: Aktivirajte svoj korisnički račun

source: Subscribe to newsletter
hr: Pretplatite se na newsletter

source: There's nothing in your bag.
hr: Vaša košarica je prazna.

source: Looks like {} is all sold out You'll have to remove it from your bag to continue.
hr: Čini se da je {} rasprodan Morat ćete ga ukloniti iz košarice da bi mogli nastaviti.

source: We've got only {} {} left, please remove at least {} from your bag to continue.
hr: Ostalo nam je samo {} {}, molimo uklonite barem {} iz košarice da bi mogli nastaviti.
